IDEA StatiCa Open Model
LineSupportSegment.SupportTypeRY Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Support type in dirrection round Y
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public SupportTypeInDirrection SupportTypeRY { get; set; }
Public Property SupportTypeRY As SupportTypeInDirrection
	Get
	Set
public:
property SupportTypeInDirrection SupportTypeRY {
	SupportTypeInDirrection get ();
	void set (SupportTypeInDirrection value);
}
Property Value
Type: SupportTypeInDirrection
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace